Тест/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Обмен</name>
      <description>Обмен</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьИнтерфейсТакси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/src/Catalogs/Пользователи/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//УчетГазаСервер.НастроитьФормуСписка(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	УправлениеПользователямиСервер.ОбновитьСправочникПользователей();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРоли(Команда)
	ПроверитьРолиНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПроверитьРолиНаСервере()
	перем Выборка, ПользовательИБ, Роль, ПроверитьПользователя;
	
	Выборка = Справочники.Пользователи.Выбрать();
	пока Выборка.Следующий() цикл
		если Выборка.ЭтоГруппа или Выборка.Недействителен тогда
			продолжить;
		конецесли;
		
		УстановитьПривилегированныйРежим(истина);
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		УстановитьПривилегированныйРежим(ложь);
		
		ПроверитьПользователя = ложь;
		
		для каждого Роль из ПользовательИБ.Роли цикл
			если ЗначениеЗаполнено(Роль.Комментарий) тогда
				ПроверитьПользователя = истина;
				прервать;
			конецесли;
		конеццикла;
		
		если ПроверитьПользователя тогда
			Сообщить(Выборка.Наименование);
		конецесли;
	конеццикла;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьИнтерфейсТакси(Команда)
	если не УправлениеПользователямиПовтИсп.РольДоступнаАдминистраторСистемы() тогда
		возврат;
	конецесли;
	если Вопрос("Включить интерфейс ""Такси"" для всех пользователей?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
		НастроитьИнтерфейсНаСервере(ВариантИнтерфейсаКлиентскогоПриложения.Такси, Вопрос("Установить интерфейс ""Такси"" как обязательный?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да);
	конецесли;
КонецПроцедуры
&НаКлиенте
Процедура ОтключитьИнтерфейсТакси(Команда)
	если не УправлениеПользователямиПовтИсп.РольДоступнаАдминистраторСистемы() тогда
		возврат;
	конецесли;
	если Вопрос("Отключить интерфейс ""Такси"" для всех пользователей?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
		НастроитьИнтерфейсНаСервере(ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2, ложь);
	конецесли;
КонецПроцедуры

&НаСервере
Процедура НастроитьИнтерфейсНаСервере(ВариантИнтерфейса, ИспользоватьИнтерфейсТакси)
	перем Запрос, Выборка;
	перем Пользователь, ПользовательИБ;
	перем Изменено;
	
	Запрос = новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Наименование,
	|	ИдентификаторПользователяИБ,
	|	ИспользоватьИнтерфейсТакси
	|ИЗ
	|	Справочник.Пользователи
	|ГДЕ
	|	НЕ ЭтоГруппа
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	пока Выборка.Следующий() цикл
		Изменено = ложь;
		
		если Выборка.ИспользоватьИнтерфейсТакси <> ИспользоватьИнтерфейсТакси тогда
			Пользователь = Выборка.Ссылка.ПолучитьОбъект();
			Пользователь.ИспользоватьИнтерфейсТакси = ИспользоватьИнтерфейсТакси;
			Пользователь.ОбменДанными.Загрузка = истина;
			Пользователь.Записать();
			
			Изменено = истина;
		конецесли;
		
		УстановитьПривилегированныйРежим(истина);
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		УстановитьПривилегированныйРежим(ложь);
		
		если ПользовательИБ <> неопределено тогда
			если УправлениеПользователямиСервер.НастроитьИнтерфейсПриложения(ПользовательИБ.Имя, ВариантИнтерфейса) тогда
				Изменено = истина;
			конецесли;
		конецесли;
		
		если Изменено тогда
			Сообщить(Выборка.Наименование);
		конецесли;
	конеццикла;
КонецПроцедуры
